weblog/app/controllers/comments_controller.rb

INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["body", "my first comment"], ["created_at", "2019-03-12 05:09:00.722317"], ["updated_at", "2019-03-12 05:09:00.722317"]]
---
  def create
    comment = @post.comments.create!(comments_params)