weblog/app/channels/comments_channel.rb

  def subscribed
    stream_for Post.last
---
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]